{
  "nowItems": [
    {
      "itemTitle": "BCM MoneyIQ Social",
      "itemCaption": "My biggest contracted project right now - MoneyIQ Social is a soon-to-be content library and planning tool for Beavercreek Marketing clients. I recently finished designing most of the UI, and have started building out the HTML and CSS.",
      "itemCategory": "ghm",
      "linkTitle": "",
      "linkHref": ""
    },
    {
      "itemTitle": "Pixel Planet Today",
      "itemCaption": "The world is constantly calling for environmental facts and pixel art: making this the project that never sleeps. I am trying to get into a more consistent posting schedule, but what can I say, there is much to be done.",
      "itemCategory": "tb",
      "linkTitle": "View the Pixel Planet Today Website",
      "linkHref": "https://pixelplanettoday.com"
    },
    {
      "itemTitle": "Etsy and Square Listings",
      "itemCaption": "Though I want to expand the Pixel Planet Today merch offerings, I'm currently working on the listings already up. That means finishing exports for wallpapers, getting stickers up on Etsy, and other organizational things to tie up loose ends.",
      "itemCategory": "tb",
      "linkTitle": "View the Pixel Store",
      "linkHref": "https://shop.pixelplanettoday.com"
    },
    {
      "itemTitle": "Asana Mites Tool",
      "itemCaption": "To-do lists are amazing, but they are a struggle at the same time. It's annoying when making the to-do list becomes part of the to-do list! So, I decided to use the Asana API to create a simple Python program that allows a user to manage crazy-simple tasks easier. Instead of firing up the Asana app, navigating to the right workspace, project, and then section to only create a task that says, 'wash dishes', I can now open the program and write the task title and boom! It's basic functionality is implemented, as are some basic functions like clearing done tasks and getting info about the Mitebox (your container of mites)",
      "itemCategory": "p",
      "linkTitle": "View the GitHub Repo",
      "linkHref": "https://github.com/samharp/asana-mites"
    },
    {
      "itemTitle": "Wasted Space",
      "itemCaption": "The first game in the Terrabyte roster, I'm super excited for when it can see the light of day. There is plenty of work yet to be done, but the best things are never easy.",
      "itemCategory": "tb",
      "linkTitle": "",
      "linkHref": ""
    },
    {
      "itemTitle": "Omaha & Nebraska Public Transportation Plan",
      "itemCaption": "Because I'm such an urbanism nerd, something that I've found myself doing is creating a map that outlines where public transportation improvements could be made in Omaha and other Central Nebraska locations. Do I expect these ideas to bloom to fruition? Not exactly, but if they did, man, the state would be all the better for it.",
      "itemCategory": "p",
      "linkTitle": "View the custom Google Map",
      "linkHref": "https://www.google.com/maps/d/u/0/edit?mid=1m-HwihuWTXU6SkHG9q-nHJ25keWnUkc&usp=sharing"
    },
    {
      "itemTitle": "PC Build",
      "itemCaption": "It's been awhile since I built my last desktop PC (10 years at this point!), so there's no time like the present! This one however, is different. I'm building this one with 100% used parts in an effort to cut down on e-waste! I plan on making it the first company computer for Terrabyte, but there are a few parts that I have yet to gather.",
      "itemCategory": "p",
      "linkTitle": "",
      "linkHref": ""
    },
    {
      "itemTitle": "Reading",
      "itemCaption": "I used to read a lot when I was younger, so to get back into reading has been really fun! I'm in-between books right now, but I have recently read Supermarket, Birdwing, Perks of Being a Wallflower, and a couple of others.",
      "itemCategory": "p",
      "linkTitle": "",
      "linkHref": ""
    }
  ],

  "oldItems": [
    {
      "itemTitle": "<little-bytes> October Newsletter",
      "itemCaption": "It's that time of year for another newsletter! It feels like there has been so much going on, so I'm really excited to get it all bundled up in a newsletter.",
      "itemCategory": "tb",
      "linkTitle": "Sign up for the newsletter",
      "linkHref": "https://terrabyte.eco/#newsletter"
    },
    {
      "itemTitle": "OriTech Materials",
      "itemCaption": "I like getting paid for design work, but I especially love paid design work in the realm of Terrabyte. Currently, I'm doing some website work for a company called OriTech, including their logo, website, and possible animations. It's all pixel art too!",
      "itemCategory": "tb",
      "linkTitle": "",
      "linkHref": ""
    },
    {
      "itemTitle": "Now Page",
      "itemCaption": "Building this page is, on its own, a task. Though the basic page is up and ready, I'm planning on later implementing 'now' items through WordPress to more easily create, update, and sort items.",
      "itemCategory": "p",
      "linkTitle": "",
      "linkHref": ""
    },
    {
      "itemTitle": "Painting",
      "itemCaption": "I'm not much of a painter, but I do really enjoy it. I'm currently finishing up the first painting I have attempted in a long time, and who knows, maybe more will follow.",
      "itemCategory": "p",
      "linkTitle": "",
      "linkHref": ""
    }
  ]
}