{
  "nowItems": [
    {
      "itemDateExpire": "2026-01-20",
      "itemTitle": "Wasted Space",
      "itemCaption": "The first game in the Terrabyte roster, the concept is to blast space enemies, collect destroyed materials, and recycle them into ship upgrades. We showcased our game in Berlin (yes, Germany!) at GTF and now you can play it too! I'm still working on some additions to the game hence why it's here and not on the main portfolio page.",
      "itemCategory": "tb",
      "linkTitle": "View the Wasted Space website",
      "linkHref": "https://www.wastedspace.fun"
    },
    {
      "itemTitle": "Birding",
      "itemCaption": "I was raised on the outdoors, but as I got older, my studies and work grew to take up more and more of my free time. And now living in a big city, it can sometimes feel like I'm more disconnected to the natural world than my environmental work would suggest (and more than I would like). That was, until my brother introduced me to birding. I was skeptical on if I would actually enjoy it (or if it was an 'old person activity' like I previously thought), but it's a great way to get outside, connect with local wildlife, and be more mindful of what's out there.",
      "itemCategory": "p",
      "linkTitle": "I'm on eBird!",
      "linkHref": "https://ebird.org/profile/NjE4NTM3Ng"
    },
    {
      "itemTitle": "Square Listings",
      "itemCaption": "Though I want to expand the Pixel Planet Today merch offerings, I'm currently working on the listings already up. That means finishing exports for wallpapers, getting stickers up on Etsy, and other organizational things to tie up loose ends.",
      "itemCategory": "tb",
      "linkTitle": "View the Webstore",
      "linkHref": "https://shop.pixelplanettoday.com"
    },
    {
      "itemTitle": "byteOS: Notes",
      "itemCaption": "A tiny pixel art note-taking app that came to be mostly as an experiment for lightweight, offline tools. The app is released, but work on basic features is very much ongoing (like font packs, auto-saving, and recent notes).",
      "itemCategory": "tb",
      "linkTitle": "Download on Android",
      "linkHref": "https://play.google.com/store/apps/details?id=com.terrabyte.byteosnotes"
    },
    {
      "itemTitle": "Pixel Planet Today",
      "itemCaption": "The world is constantly calling for environmental facts and pixel art: making this the project that never sleeps. I am trying to get into a more consistent posting schedule, but what can I say, there is much to be done.",
      "itemCategory": "tb",
      "linkTitle": "View the Pixel Planet Today Website",
      "linkHref": "https://www.pixelplanettoday.com"
    },
    {
      "itemTitle": "Reading",
      "itemCaption": "Hit the reading goal for the year, but still working on a couple! TBR is getting smaller, but there is quite a pile to get through...",
      "itemCategory": "p"
    },
    {
      "itemTitle": "The Aurum Framework",
      "itemCaption": "After years of working in HTML and CSS, I am finally starting to build my own framework! It's nothing compared to Bootstrap, but a lightweight system to help build flex layouts more easily. I already use the same styles for this across (most of) my projects, so the thought is that if I can use the same resource for all of them, I don't have to have duplicate code everywhere. It's not exactly ready for primetime, but if you'd like to check it out, you're more than welcome to!",
      "itemCategory": "ghm",
      "linkTitle": "Check out the GitHub Repo",
      "linkHref": "https://github.com/goldenharpmedia/aurum"
    },
    {
      "itemTitle": "Omaha & Nebraska Public Transportation Plan",
      "itemCaption": "Because I'm such an urbanism nerd, something that I've found myself doing is creating a map that outlines where public transportation improvements could be made in Omaha and other Central Nebraska locations. Do I expect these ideas to bloom to fruition? Not exactly, but if they did - boy, the state would be all the better for it. :)",
      "itemCategory": "p",
      "linkTitle": "View the custom Google Map",
      "linkHref": "https://www.google.com/maps/d/u/0/edit?mid=1m-HwihuWTXU6SkHG9q-nHJ25keWnUkc&usp=sharing"
    }
  ],

  "oldItems": [
    {
      "itemDateExpire": "2025-08-25",
      "itemTitle": "Funding",
      "itemCaption": "Seeking funds to help us help Terrabyte make the planet a little bit better of a place. Have to spend money to make money, or something like that. Fingers crossed! (psst get in touch if you are looking for funding opportunities..? :)",
      "itemCategory": "p",
      "linkTitle": "What is Terrabyte?",
      "linkHref": "https://www.terrabyte.eco"
    },
    {
      "itemDateExpire": "2025-08-25",
      "itemTitle": "Earth Day Omaha",
      "itemCaption": "The biggest Earth Day event in the Omaha area, Earth Day Omaha is a celebration of our planet and the people who work to protect it. I recently joined the Green Omaha Coalition Board of Directors (yay!), and I've been very busy helping plan this year's event and create social media content to promote it.",
      "itemCategory": "p",
      "linkTitle": "Learn more",
      "linkHref": "https://www.greenomaha.org/about-earthdayomaha"
    },
    {
      "itemTitle": "Omaha Metro Bike Trail Connection Proposal",
      "itemCaption": "It's fun to envision a world/city that is built for people, not for cars. And since I'm an avid bicyclist, I made a map that plots where trail connections would make the most positive impact in the metro. I actually talked with the Papio NRD about my ideas, and while I don't know if I'll ever see them come to light (they say they will keep them in mind as other proposals move forward!), I at least did what I could as a concerned citizen to try.",
      "itemCategory": "p",
      "linkTitle": "View the custom Google Map",
      "linkHref": "https://www.google.com/maps/d/u/0/edit?mid=1YDg1iHCJykm6U4PgYVpDH3Z2dd1haQE&usp=sharing"
    },
    {
      "itemTitle": "PC Build",
      "itemCaption": "It's been awhile since I built my last desktop PC (10 years at this point!), so there's no time like the present! This one however, is different. I'm building this one with 100% used parts in an effort to cut down on e-waste! I plan on making it the first company computer for Terrabyte, but there are a few parts that I have yet to gather.",
      "itemCategory": "p",
      "linkTitle": "",
      "linkHref": ""
    },
    {
      "itemTitle": "Wasted Space",
      "itemCaption": "The first game in the Terrabyte roster, I'm super excited for it to go public! Currently the game is in closed beta, but we're aiming for an open beta to launch in June. We're going to showcase our game in Berlin (yes, Germany!) at GTF, so we're getting things prepared for that as well.",
      "itemCategory": "tb",
      "linkTitle": "View the Wasted Space website",
      "linkHref": "https://www.wastedspace.fun"
    },
    {
      "itemTitle": "Reading",
      "itemCaption": "I used to read a lot when I was younger, so to get back into reading has been really fun! I'm currently reading Tomorrow and Tomorrow and Tomorrow - it's a story about a budding game development duo, and it's really good 😊",
      "itemCategory": "p",
      "linkTitle": "",
      "linkHref": ""
    },
    {
      "itemTitle": "BCM MoneyIQ Social",
      "itemCaption": "My biggest contracted project right now - MoneyIQ Social is a soon-to-be content library and planning tool for Beavercreek Marketing clients. I recently finished designing most of the UI, and have started building out the HTML and CSS.",
      "itemCategory": "ghm",
      "linkTitle": "",
      "linkHref": ""
    },
    {
      "itemTitle": "Asana Mites Tool",
      "itemCaption": "To-do lists are amazing, but they are a struggle at the same time. It's annoying when making the to-do list becomes part of the to-do list! So, I decided to use the Asana API to create a simple Python program that allows a user to manage crazy-simple tasks easier. Instead of firing up the Asana app, navigating to the right workspace, project, and then section to only create a task that says, 'wash dishes', I can now open the program and write the task title and boom! It's basic functionality is implemented, as are some basic functions like clearing done tasks and getting info about the Mitebox (your container of mites)",
      "itemCategory": "p",
      "linkTitle": "View the GitHub Repo",
      "linkHref": "https://github.com/samharp/asana-mites"
    },
    {
      "itemTitle": "<little-bytes> October Newsletter",
      "itemCaption": "It's that time of year for another newsletter! It feels like there has been so much going on, so I'm really excited to get it all bundled up in a newsletter.",
      "itemCategory": "tb",
      "linkTitle": "Sign up for the newsletter",
      "linkHref": "https://terrabyte.eco/#newsletter"
    },
    {
      "itemTitle": "OriTech Materials",
      "itemCaption": "I like getting paid for design work, but I especially love paid design work in the realm of Terrabyte. Currently, I'm doing some website work for a company called OriTech, including their logo, website, and possible animations. It's all pixel art too!",
      "itemCategory": "tb",
      "linkTitle": "",
      "linkHref": ""
    },
    {
      "itemTitle": "Now Page",
      "itemCaption": "Building this page is, on its own, a task. Though the basic page is up and ready, I'm planning on later implementing 'now' items through WordPress to more easily create, update, and sort items.",
      "itemCategory": "p",
      "linkTitle": "",
      "linkHref": ""
    },
    {
      "itemTitle": "Painting",
      "itemCaption": "I'm not much of a painter, but I do really enjoy it. I'm currently finishing up the first painting I have attempted in a long time, and who knows, maybe more will follow.",
      "itemCategory": "p",
      "linkTitle": "",
      "linkHref": ""
    }
  ]
}